{"class_name": "Model", "config": {"name": "model_84", "layers": [{"name": "input_84", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_84"}, "inbound_nodes": []}, {"name": "embedding_84", "class_name": "Embedding", "config": {"name": "embedding_84", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 15909, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_84", 0, 0, {}]]]}, {"name": "conv1d_100", "class_name": "Conv1D", "config": {"name": "conv1d_100", "trainable": true, "filters": 128, "kernel_size": [5], "strides": [1], "padding": "valid", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["embedding_84", 0, 0, {}]]]}, {"name": "max_pooling1d_100", "class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_100", "trainable": true, "strides": [5], "pool_size": [5], "padding": "valid"}, "inbound_nodes": [[["conv1d_100", 0, 0, {}]]]}, {"name": "dropout_84", "class_name": "Dropout", "config": {"name": "dropout_84", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["max_pooling1d_100", 0, 0, {}]]]}, {"name": "dense_178", "class_name": "Dense", "config": {"name": "dense_178", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_84", 0, 0, {}]]]}, {"name": "flatten_84", "class_name": "Flatten", "config": {"name": "flatten_84", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dense_178", 0, 0, {}]]]}, {"name": "dense_179", "class_name": "Dense", "config": {"name": "dense_179", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_84", 0, 0, {}]]]}], "input_layers": [["input_84", 0, 0]], "output_layers": [["dense_179", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}