{"class_name": "Model", "config": {"name": "model_62", "layers": [{"name": "input_63", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_63"}, "inbound_nodes": []}, {"name": "embedding_63", "class_name": "Embedding", "config": {"name": "embedding_63", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 15909, "output_dim": 200, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["input_63", 0, 0, {}]]]}, {"name": "bidirectional_62", "class_name": "Bidirectional", "config": {"name": "bidirectional_62", "trainable": true, "layer": {"class_name": "LSTM", "config": {"name": "lstm_62", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 64, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.5, "recurrent_dropout": 0.5, "implementation": 1}}, "merge_mode": "concat"}, "inbound_nodes": [[["embedding_63", 0, 0, {}]]]}, {"name": "global_max_pooling1d_62", "class_name": "GlobalMaxPooling1D", "config": {"name": "global_max_pooling1d_62", "trainable": true}, "inbound_nodes": [[["bidirectional_62", 0, 0, {}]]]}, {"name": "dense_123", "class_name": "Dense", "config": {"name": "dense_123", "trainable": true, "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["global_max_pooling1d_62", 0, 0, {}]]]}, {"name": "dropout_62", "class_name": "Dropout", "config": {"name": "dropout_62", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_123", 0, 0, {}]]]}, {"name": "dense_124", "class_name": "Dense", "config": {"name": "dense_124", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_62", 0, 0, {}]]]}], "input_layers": [["input_63", 0, 0]], "output_layers": [["dense_124", 0, 0]]}, "keras_version": "2.1.6", "backend": "tensorflow"}